In [2]:
import pandas as pd
import numpy as np

In [13]:
#upcasting in case of missing value
a= pd.Series([1,2])
print(a)
a[0]=None
a

0    1
1    2
dtype: int64

0    NaN
1    2.0
dtype: float64

In [14]:
#string data type in pandas is always object
a = np.array(['krishan','sweta'])
s = pd.Series(a)
a.dtype, s.dtype

(dtype('<U7'), dtype('O'))

In [134]:
#Fill missing values.
a = np.array([1,None,3,2,None])
s= pd.Series([1,None,3,2,None])
print('numpy a dtype = ',a.dtype,'. pandas s dtype = ',s.dtype)

print(s)

numpy a dtype =  object . pandas s dtype =  float64
0    1.0
1    NaN
2    3.0
3    2.0
4    NaN
dtype: float64

In [135]:
a.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [136]:
s.sum()

6.0

In [137]:
1+np.nan

nan

## Operating on null values

### Series

In [138]:
s.isnull()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [139]:
s.notnull()

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [140]:
s.dropna()

0    1.0
2    3.0
3    2.0
dtype: float64

In [144]:
s.ffill()

0    1.0
1    1.0
2    3.0
3    2.0
4    2.0
dtype: float64

In [143]:
s.bfill()

0    1.0
1    3.0
2    3.0
3    2.0
4    NaN
dtype: float64

In [146]:
s.fillna(s.sum())

0    1.0
1    6.0
2    3.0
3    2.0
4    6.0
dtype: float64

### Data frame

In [9]:
d = pd.DataFrame(np.random.randint(0,10,(3,4)),dtype= 'int', columns = list('ABCD'))
for _ in range(4):
    d.iloc[np.random.randint(0,3),np.random.randint(0,4)] = np.nan
d

   A  B    C    D
0  7  7  NaN  NaN
1  1  2  5.0  4.0
2  7  8  1.0  NaN

In [10]:
d.dropna()

   A  B    C    D
1  1  2  5.0  4.0

In [11]:
d.dropna(axis='columns')

   A  B
0  7  7
1  1  2
2  7  8

In [12]:
d.dropna(how='all') #by default axis is rows

   A  B    C    D
0  7  7  NaN  NaN
1  1  2  5.0  4.0
2  7  8  1.0  NaN

In [14]:
d.dropna( thresh=3) #minumum number of non null values is defined by threshold

   A  B    C    D
1  1  2  5.0  4.0
2  7  8  1.0  NaN

In [15]:
d.isnull()

       A      B      C      D
0  False  False   True   True
1  False  False  False  False
2  False  False  False   True

In [16]:
d.isnull().sum(axis = 1)

0    2
1    0
2    1
dtype: int64

In [17]:
#slicing revisited
print(d.loc[[True,False,True],['B','D']])
d.loc[[True,False],[False,True,True]]

   B   D
0  7 NaN
2  8 NaN

   B   C
0  7 NaN

In [18]:
print(d.isnull()['D'])
d.loc[d.isnull()['D']]

0     True
1    False
2     True
Name: D, dtype: bool

   A  B    C   D
0  7  7  NaN NaN
2  7  8  1.0 NaN

In [19]:
d

   A  B    C    D
0  7  7  NaN  NaN
1  1  2  5.0  4.0
2  7  8  1.0  NaN

In [20]:
d.fillna(method='ffill',axis = 1)

     A    B    C    D
0  7.0  7.0  7.0  7.0
1  1.0  2.0  5.0  4.0
2  7.0  8.0  1.0  1.0